Revit 2024 API
Frame Constructor
 Default constructor. Uses global origin and standard basis vectors.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public Frame()
Visual Basic
Public Sub New
Visual C++
public:
Frame()
See Also
Frame Class
Frame Overload
Autodesk.Revit.DB Namespace